src/cf/DataProcessors/уатОчисткаИстории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатОчисткаИстории</Name>
			<Comment>Очистка истории ТС</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияКоординатМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияКоординатМП</Name>
			<Comment>Используется для хранения истории местоположения</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лат</Name>
					<Comment>Широта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лон</Name>
					<Comment>Долгота</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алт</Name>
					<Comment>Высота над уровнем моря</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяUTC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатПробегРасходПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатПробегРасходПоМониторингу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРаботыДвигателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеОдометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатДополнительныеСведенияПоGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатДополнительныеСведенияПоGPS</Name>
			<Comment>Дополнительные сведения транспортных средств по данным системы спутникового мониторинга</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьСобытия</Name>
					<Comment>Длительность события</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельноеЗначение</Name>
					<Comment>Предельное значение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Лон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>Транспортное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Тип события</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипСобытияGPS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатКоординатыПоМониторингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатКоординатыПоМониторингу</Name>
			<Comment>История местоположения транспортных средств по данным системы спутникового мониторинга (GPS)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияОпозданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияОпозданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>GUIDСтрокиМЛ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОпоздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаршрутныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрибытиеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрибытиеПрогноз</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/уатОчисткаИстории/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// начало блока стандартных операций
	ДопПараметрыОткрытие = Новый Структура("ИмяФормы", ИмяФормы);
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	Параметры.Свойство("флДополнительныеСведенияПоGPS", флДополнительныеСведенияПоGPS);
	Параметры.Свойство("флИсторияМестоположенияПоGPS",  флИсторияМестоположенияПоGPS);
	Параметры.Свойство("флКоординатыПоМониторингу",     флКоординатыПоМониторингу);
	Параметры.Свойство("флПробегРасходПоМониторингу",   флПробегРасходПоМониторингу);
	Параметры.Свойство("флИсторияОпозданий",            флИсторияОпозданий);
	
	Если Константы.уатИспользоватьМобильноеПриложениеВодителя.Получить() Тогда 
		ЗаполнитьНастройкиСохраненияИсторииМестоположения();
		
		Если РежимХраненияИсторииМестоположения = 0 Тогда 
			флИсторияМестоположенияПоGPS = Ложь;
			Элементы.флИсторияМестоположенияПоGPS.Видимость = Ложь;
		КонецЕсли;
	Иначе 
		флИсторияМестоположенияПоGPS = Ложь;
		Элементы.флИсторияМестоположенияПоGPS.Видимость = Ложь;
	КонецЕсли;
	
	Если Не Константы.уатИспользоватьМониторинг.Получить() Тогда 
		флДополнительныеСведенияПоGPS = Ложь;
		флКоординатыПоМониторингу = Ложь;
		флПробегРасходПоМониторингу = Ложь;
		
		Элементы.флДополнительныеСведенияПоGPS.Видимость = Ложь;
		Элементы.флКоординатыПоМониторингу.Видимость = Ложь;
		Элементы.флПробегРасходПоМониторингу.Видимость = Ложь;
	КонецЕсли;
	
	Если Не Константы.уатПрогнозированиеОпозданийПоМаршрутнымЛистам.Получить() Тогда
		флИсторияОпозданий = Ложь;
		Элементы.флИсторияОпозданий.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатИсторияКоординатМП) Тогда 
		флИсторияМестоположенияПоGPS = Ложь;
		Элементы.флИсторияМестоположенияПоGPS.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатДополнительныеСведенияПоGPS) Тогда 
		флДополнительныеСведенияПоGPS = Ложь;
		Элементы.флДополнительныеСведенияПоGPS.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатКоординатыПоМониторингу) Тогда 
		флКоординатыПоМониторингу = Ложь;
		Элементы.флКоординатыПоМониторингу.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатПробегРасходПоМониторингу) Тогда 
		флПробегРасходПоМониторингу = Ложь;
		Элементы.флПробегРасходПоМониторингу.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.уатИсторияОпозданий) Тогда
		флИсторияОпозданий = Ложь;
		Элементы.флИсторияОпозданий.Видимость = Ложь;
	КонецЕсли;
	
	ВосстановитьНастройки();
	ЗагрузитьПараметрыРеглЗаданий();
	ОбновитьДанныеРеглЗаданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// начало блока стандартных операций
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблТС

&НаКлиенте
Процедура ТаблТСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Состояние(НСтр("ru = 'Добавлено ТС'; en = 'Added TC'") + " <" + Строка(ВыбранноеЗначение) + ">",,, БиблиотекаКартинок.Информация32);
	
	НайдСтроки = ТаблТС.НайтиСтроки(Новый Структура("Ссылка", ВыбранноеЗначение));
	Если НайдСтроки.Количество() = 0 Тогда 
		НовСтрока = ТаблТС.Добавить();
		НовСтрока.Ссылка = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьИсторию(Команда)
	
	Если Не ЗначениеЗаполнено(ПериодПо) Тогда 
		ТекстОшибки = НСтр("en='It is necessary to specify expiry date of cleaning period.';ru='Необходимо указать дату окончания периода очистки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПериодПо");
		Возврат;
	КонецЕсли;
	
	Если ПериодС > ПериодПо Тогда 
		ТекстОшибки = НСтр("en='Begin date of clean period cannot be greater than end date.';ru='Дата начала периода очистки не может быть больше даты окончания.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ПериодС");
		Возврат;
	КонецЕсли;
	
	Если Не флДополнительныеСведенияПоGPS 
		И Не флИсторияМестоположенияПоGPS 
		И Не флКоординатыПоМониторингу 
		И Не флПробегРасходПоМониторингу 
		И Не флИсторияОпозданий Тогда 
		ТекстОшибки = НСтр("ru = 'Необходимо выбрать регистры для очистки'; en = 'You must select the registers to clear.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ТаблТС.Количество() Тогда 
		ТекстВопроса = НСтр("ru = 'Будут удалены данные по указанным ТС в выбранных регистрах за период. Операция может занять длительное время. Продолжить?'; en = 'Data on the specified vehicles in the selected registers for the specified period will be deleted. This operation may take a significant amount of time. Continue?'");
	Иначе 
		ТекстВопроса = НСтр("ru = 'Будут удалены все данные в выбранных регистрах за период. Операция может занять длительное время. Продолжить?'; en = 'All data in the selected registers for the specified period will be deleted. This operation may take a long time. Continue?'");
	КонецЕсли;
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("ОчиститьИсториюПослеОтвета", ЭтотОбъект),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,
		,
		,
		НСтр("ru = 'Очистка данных'; en = 'Data clearing'")
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ПериодС;
	ДиалогПериода.Период.ДатаОкончания = ПериодПо;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТС(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.уатТС.ФормаВыбора", ПараметрыФормы, Элементы.ТаблТС,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсемиТС(Команда)
	
	Если ТаблТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ЗаполнитьВсемиТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнение(Команда)
	
	Если ТаблТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("РасширенноеЗаполнениеОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table before filling?';ru='Очистить таблицу перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена
		);
		
	Иначе 
		РасширенноеЗаполнениеУстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТС(Команда)
	
	Если ТаблТС.Количество() Тогда 
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОчиститьТаблицуТСОчистка", ЭтотОбъект),
			НСтр("en='You want to clear the table?';ru='Очистить таблицу?'"),
			РежимДиалогаВопрос.ДаНет
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегламентноеЗадание(Команда)
	
	ИдентификаторРеглЗадания  = ОчисткаДанных;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Идентификатор", ИдентификаторРеглЗадания);
	ПараметрыФормы.Вставить("Действие",      "Изменить");
	
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗадание(Команда)
	Если Модифицированность Тогда 
		ТекстНСТР = НСтр("ru = 'Необходимо записать изменения.'; en = 'It is necessary to record the changes.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	РеглЗадание = ОчисткаДанных;
	РеглЗаданиеНаименование = Нстр("ru = 'Очистка данных по мониторингу'; en = 'Cleaning up monitoring data'");
	ВыполнитьРегламентноеЗаданиеВручную(РеглЗадание, РеглЗаданиеНаименование);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусРегламентногоЗадания(Команда)
	ОбновитьДанныеРеглЗаданий();
КонецПроцедуры

&НаКлиенте
Процедура РеглНастроитьПериодИРегистры(Команда)
	
	Если Модифицированность Тогда
		ТекстНСТР = НСтр("ru = 'Необходимо записать изменения.'; en = 'It is necessary to record the changes.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыНастроек = Новый Структура();
	ПараметрыНастроек.Вставить("флПробегРасходПоМониторингу",   РеглЗадание_флПробегРасходПоМониторингу);
	ПараметрыНастроек.Вставить("флДополнительныеСведенияПоGPS", РеглЗадание_флДополнительныеСведенияПоGPS);
	ПараметрыНастроек.Вставить("флКоординатыПоМониторингу",     РеглЗадание_флКоординатыПоМониторингу);
	ПараметрыНастроек.Вставить("флИсторияМестоположенияПоGPS",  РеглЗадание_флИсторияМестоположенияПоGPS);
	ПараметрыНастроек.Вставить("флИсторияОпозданий",            РеглЗадание_флИсторияОпозданий);
	ПараметрыНастроек.Вставить("ВидПериода",                    РеглЗадание_ВидПериода);
	ПараметрыНастроек.Вставить("Количество",                    РеглЗадание_Количество);
	
	ПараметрыНастроек.Вставить("ПоказыватьВсеРеглЗадания",      Ложь);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОткрытьНастройкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.уатПанельНастроекВнешнихСистем.Форма.НастройкиРегламентныхЗаданий", 
	ПараметрыНастроек,,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНаСервере()
	СохранитьНастройки();
	СохранитьПараметрыРеглЗаданий();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()

	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("флПробегРасходПоМониторингу",   флПробегРасходПоМониторингу);
	СтруктураНастроек.Вставить("флДополнительныеСведенияПоGPS", флДополнительныеСведенияПоGPS);
	СтруктураНастроек.Вставить("флКоординатыПоМониторингу",     флКоординатыПоМониторингу);
	СтруктураНастроек.Вставить("флИсторияМестоположенияПоGPS",  флИсторияМестоположенияПоGPS);
	СтруктураНастроек.Вставить("флИсторияОпозданий",            флИсторияОпозданий);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Обработка.уатОчисткаИстории.НастройкиРегламентныхЗаданийПоОчистке",
		"ОбщиеНастройкиФормыОчисткиДанныхПоМониторингу",
		СтруктураНастроек
	);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
		"Обработка.уатОчисткаИстории.НастройкиРегламентныхЗаданийПоОчистке", 
		"ОбщиеНастройкиФормыОчисткиДанныхПоМониторингу"
	);
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		СтруктураНастроек.Свойство("флПробегРасходПоМониторингу",   флПробегРасходПоМониторингу);
		СтруктураНастроек.Свойство("флДополнительныеСведенияПоGPS", флДополнительныеСведенияПоGPS);
		СтруктураНастроек.Свойство("флКоординатыПоМониторингу",     флКоординатыПоМониторингу);
		СтруктураНастроек.Свойство("флКоординатыПоМониторингу",     флКоординатыПоМониторингу);
		СтруктураНастроек.Свойство("флИсторияМестоположенияПоGPS",  флИсторияМестоположенияПоGPS);
		СтруктураНастроек.Свойство("флИсторияОпозданий",            флИсторияОпозданий);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыРеглЗаданий()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("флПробегРасходПоМониторингу",   РеглЗадание_флПробегРасходПоМониторингу);
	СтруктураПараметров.Вставить("флДополнительныеСведенияПоGPS", РеглЗадание_флДополнительныеСведенияПоGPS);
	СтруктураПараметров.Вставить("флКоординатыПоМониторингу",     РеглЗадание_флКоординатыПоМониторингу);
	СтруктураПараметров.Вставить("флИсторияМестоположенияПоGPS",  РеглЗадание_флИсторияМестоположенияПоGPS);
	СтруктураПараметров.Вставить("флИсторияОпозданий",            РеглЗадание_флИсторияОпозданий);
	СтруктураПараметров.Вставить("ВидПериода",                    РеглЗадание_ВидПериода);
	СтруктураПараметров.Вставить("Количество",                    РеглЗадание_Количество);
	
	ХранилищеНастроек = Новый ХранилищеЗначения(СтруктураПараметров);
	Константы.уатПараметрыРеглЗаданияОчисткаДанныхПоМониторингу.Установить(ХранилищеНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыРеглЗаданий()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПараметров = Константы.уатПараметрыРеглЗаданияОчисткаДанныхПоМониторингу.Получить().Получить();
	Если СтруктураПараметров = Неопределено Тогда
		РеглЗадание_ВидПериода = 1;
		РеглЗадание_Количество = 1;
		Возврат;
	КонецЕсли;
	РеглЗадание_флПробегРасходПоМониторингу   = СтруктураПараметров.флПробегРасходПоМониторингу;
	РеглЗадание_флДополнительныеСведенияПоGPS = СтруктураПараметров.флДополнительныеСведенияПоGPS;
	РеглЗадание_флКоординатыПоМониторингу     = СтруктураПараметров.флКоординатыПоМониторингу;
	РеглЗадание_флИсторияМестоположенияПоGPS  = СтруктураПараметров.флИсторияМестоположенияПоGPS;
	РеглЗадание_флИсторияОпозданий            = СтруктураПараметров.флИсторияОпозданий;
	РеглЗадание_ВидПериода                    = СтруктураПараметров.ВидПериода;
	РеглЗадание_Количество                    = СтруктураПараметров.Количество;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиСохраненияИсторииМестоположения()
	
	стрНастройкиХраненияИсторииМестоположения = уатМобильноеПриложениеВодителяСерверПовтИсп.ПолучитьНастройкиХраненияИсторииМестоположения();
	
	РежимХраненияИсторииМестоположения   = стрНастройкиХраненияИсторииМестоположения.РежимСохранения;
	АдресСервераБазыМестоположения       = стрНастройкиХраненияИсторииМестоположения.АдресСервера;
	ИмяБазыМестоположения                = стрНастройкиХраненияИсторииМестоположения.ИмяБазы;
	ЛогинПользователяБазыМестоположения  = стрНастройкиХраненияИсторииМестоположения.Логин;
	ПарольПользователяБазыМестоположения = стрНастройкиХраненияИсторииМестоположения.Пароль;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодС  = Период.ДатаНачала;
	ПериодПо = Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсториюПослеОтвета(Результат, ДопПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Очистка данных ...'; en = 'Clearing data...'"));
	
	мсвТС = Новый Массив();
	Для Каждого ТекСтрока Из ТаблТС Цикл 
		мсвТС.Добавить(ТекСтрока.Ссылка);
	КонецЦикла;
	
	РезультатУспешно = Истина;
	
	Если РезультатУспешно И флДополнительныеСведенияПоGPS Тогда 
		РезультатУспешно = ОчисткаДополнительныхСведенийПоGPS(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно И флИсторияМестоположенияПоGPS Тогда 
		Если РежимХраненияИсторииМестоположения = 1 Тогда 
			РезультатУспешно = ОчисткаИсторииМестоположенияВоВнешнейБД(ПериодС, ПериодПо, мсвТС);
		Иначе 
			РезультатУспешно = ОчисткаИсторииМестоположенияВРегистре(ПериодС, ПериодПо, мсвТС);
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатУспешно И флКоординатыПоМониторингу Тогда 
		РезультатУспешно = ОчисткаКоординатПоМониторингу(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно И флПробегРасходПоМониторингу Тогда 
		РезультатУспешно = ОчисткаПробегаРасходаПоМониторингу(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно И флИсторияОпозданий Тогда
		РезультатУспешно = ОчисткаИсторииОпозданий(ПериодС, ПериодПо, мсвТС);
	КонецЕсли;
	
	Если РезультатУспешно Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Очистка данных выполнена успешно.'; en = 'Data clearing completed successfully.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОчисткаИсторииМестоположенияВоВнешнейБД(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'истории местоположения во внешней БД'; en = 'location history in an external database'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Connection = Новый COMОбъект("ADODB.Connection");
	
	СтрокаПодключения = "Provider=SQLOLEDB.1;Password=" + ПарольПользователяБазыМестоположения 
		+ ";Persist Security Info=True;User ID=" + ЛогинПользователяБазыМестоположения 
		+ ";Initial Catalog=" + ИмяБазыМестоположения 
		+ ";Data Source=" + АдресСервераБазыМестоположения;
	
	Connection.ConnectionString = СтрокаПодключения;
	
	Попытка
		Connection.Open();
	Исключение
		ТекстОшибки = НСтр("en = 'Error opening connection to the external DB. ""Connection string:'; ru = 'Ошибка открытия подключения к внешней БД. ""Строка подключения:'") + " " + СтрокаПодключения + "." + Символы.ПС + 
		              НСтр("en = 'Error description:'; ru = 'Описание ошибки:'") + " " + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Command = Новый COMОбъект("ADODB.Command");
	Command.ActiveConnection = Connection;
	Command.CommandType      = 1;
	Command.CommandTimeout   = 0;
	
	Если МассивТС.Количество() Тогда 
		Для Каждого ТекТС Из МассивТС Цикл 
			ТекстКоманды = "DELETE FROM dbo.GPSData WHERE Car = '" + ТекТС + "' AND DateTimeCoord BETWEEN '"
			               + Формат(ДатаС, "ДФ=yyyy-MM-ddTHH:mm:ss")+"' AND '"+Формат(ДатаПо, "ДФ='yyyy-MM-ddTHH:mm:ss'")+"'";
			
			Command.CommandText = ТекстКоманды;
			
			Попытка
				RecordSet = Command.Execute();
			Исключение
				Connection.Close();
				ТекстОшибки = НСтр("en = 'Error executing a query on an external database of the history of the location.""Command text:'; ru = 'Ошибка при выполнении запроса к внешней БД истории местоположения.""Текст команды:'") + " " + ТекстКоманды + "." + Символы.ПС +
				              НСтр("en = 'Error description:'; ru = 'Описание ошибки:'") + " " + ОписаниеОшибки();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат Ложь;
			КонецПопытки;
		КонецЦикла;
		
	Иначе 
		ТекстКоманды = "DELETE FROM dbo.GPSData WHERE DateTimeCoord BETWEEN '"
		               + Формат(ДатаС, "ДФ=yyyy-MM-ddTHH:mm:ss")+"' AND '"+Формат(ДатаПо, "ДФ='yyyy-MM-ddTHH:mm:ss'")+"'";
		
		Command.CommandText = ТекстКоманды;
		
		Попытка
			RecordSet = Command.Execute();
		Исключение
			Connection.Close();
			ТекстОшибки = НСтр("en = 'Error executing a query on an external database of the history of the location.""Command text:'; ru = 'Ошибка при выполнении запроса к внешней БД истории местоположения.""Текст команды:'") + " " + ТекстКоманды + "." + Символы.ПС +
			              НСтр("en = 'Error description:'; ru = 'Описание ошибки:'") + " " + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Connection.Close();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОчисткаИсторииМестоположенияВРегистре(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'истории местоположения в регистре'; en = 'location history in the registry'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("мсвТС",     МассивТС);
	мЗапрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	мЗапрос.УстановитьПараметр("ДатаС",     ДатаС);
	мЗапрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатИсторияКоординатМП.Дата КАК Дата,
	|	уатИсторияКоординатМП.Время КАК Время,
	|	уатИсторияКоординатМП.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатИсторияКоординатМП КАК уатИсторияКоординатМП
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатИсторияКоординатМП.ТС В (&мсвТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И уатИсторияКоординатМП.Дата МЕЖДУ &ДатаС И &ДатаПо";
	
	мВыборка = мЗапрос.Выполнить().Выбрать();
	
	ДатаНачалаОчистки  = Дата(Год(ДатаС), Месяц(ДатаС), День(ДатаС), 0, 0, 0);
	ВремяНачалаОчистки = Дата(1, 1, 1, Час(ДатаС), Минута(ДатаС), Секунда(ДатаС));
	
	ДатаОкончанияОчистки  = Дата(Год(ДатаПо), Месяц(ДатаПо), День(ДатаПо), 0, 0, 0);
	ВремяОкончанияОчистки = Дата(1, 1, 1, Час(ДатаПо), Минута(ДатаПо), Секунда(ДатаПо));
	
	Пока мВыборка.Следующий() Цикл 
		Если (мВыборка.Дата = ДатаНачалаОчистки И мВыборка.Время < ВремяНачалаОчистки)
				Или (мВыборка.Дата = ДатаОкончанияОчистки И мВыборка.Время > ВремяОкончанияОчистки) Тогда 
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.уатИсторияКоординатМП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дата.Установить(мВыборка.Дата);
		НаборЗаписей.Отбор.Время.Установить(мВыборка.Время);
		НаборЗаписей.Отбор.ТС.Установить(мВыборка.ТС);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ТекстОшибки = НСтр("en='Error occurred while deleting vehicle location history.';ru='Возникла ошибка при удалении истории местоположения ТС.'") + Символы.ПС
				+ НСтр("en='Error description:';ru='Описание ошибки:'") + " " + ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОчисткаПробегаРасходаПоМониторингу(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'пробега и расхода по мониторингу'; en = 'mileage and consumption monitoring'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатПробегРасходПоМониторингу.Период КАК Период,
	|	уатПробегРасходПоМониторингу.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатПробегРасходПоМониторингу КАК уатПробегРасходПоМониторингу
	|ГДЕ
	|	уатПробегРасходПоМониторингу.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатПробегРасходПоМониторингу.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатПробегРасходПоМониторингу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОчисткаПробегаРасходаПоМониторингу()

&НаСервере
Функция ОчисткаДополнительныхСведенийПоGPS(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'дополнительных сведений ТС по данным мониторинга'; en = 'additional information about the vehicle based on monitoring data'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатДополнительныеСведенияПоGPS.Период КАК Период,
	|	уатДополнительныеСведенияПоGPS.ТС КАК ТС,
	|	уатДополнительныеСведенияПоGPS.ТипСобытия КАК ТипСобытия
	|ИЗ
	|	РегистрСведений.уатДополнительныеСведенияПоGPS КАК уатДополнительныеСведенияПоGPS
	|ГДЕ
	|	уатДополнительныеСведенияПоGPS.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатДополнительныеСведенияПоGPS.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатДополнительныеСведенияПоGPS.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		НаборЗаписей.Отбор.ТипСобытия.Установить(Выборка.ТипСобытия);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОчисткаДополнительныхСведенийПоGPS()

&НаСервере
Функция ОчисткаКоординатПоМониторингу(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'координат по мониторингу'; en = 'monitoring coordinates'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатКоординатыПоМониторингу.Период КАК Период,
	|	уатКоординатыПоМониторингу.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатКоординатыПоМониторингу КАК уатКоординатыПоМониторингу
	|ГДЕ
	|	уатКоординатыПоМониторингу.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатКоординатыПоМониторингу.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатКоординатыПоМониторингу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ОчисткаКоординатПоМониторингу()

&НаСервере
Функция ОчисткаИсторииОпозданий(Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	ЗаписатьЛогВЖурналРегистрации(
		НСтр("ru = 'истории прогнозов опозданий'; en = 'history of delay forecasts'"),
		ДатаС, 
		ДатаПо,
		МассивТС
	);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаС",     ДатаС);
	Запрос.УстановитьПараметр("ДатаПо",    ДатаПо);
	Запрос.УстановитьПараметр("МассивТС",  МассивТС);
	Запрос.УстановитьПараметр("ОтборПоТС", МассивТС.Количество() <> 0);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатИсторияОпозданий.Период КАК Период,
	|	уатИсторияОпозданий.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатИсторияОпозданий КАК уатИсторияОпозданий
	|ГДЕ
	|	уатИсторияОпозданий.Период МЕЖДУ &ДатаС И &ДатаПо
	|	И ВЫБОР
	|			КОГДА &ОтборПоТС
	|				ТОГДА уатИсторияОпозданий.ТС В (&МассивТС)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаборЗаписей = РегистрыСведений.уатИсторияОпозданий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.ТС.Установить(Выборка.ТС);
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВсемиТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТаблТС.Очистить();
		ЗаполнитьВсемиТСЗавершение();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		ЗаполнитьВсемиТСЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсемиТСЗавершение()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатТС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.уатТС КАК уатТС
	|ГДЕ
	|	НЕ уатТС.ПометкаУдаления
	|	И НЕ уатТС.ЭтоГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовСтрока = ТаблТС.Добавить();
		НовСтрока.Ссылка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТаблТС.Очистить();
		РасширенноеЗаполнениеУстановитьОтбор();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		РасширенноеЗаполнениеУстановитьОтбор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеУстановитьОтбор()
	
	ОткрытьФорму(
		"ОбщаяФорма.уатФормаПодбораТС", 
		Новый Структура("ИсточникПодбора", "Обработка_уатОчисткаИстории"), 
		ЭтотОбъект,
		,
		,
		,
		Новый ОписаниеОповещения("РасширенноеЗаполнениеЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенноеЗаполнениеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекТС Из РезультатЗакрытия Цикл 
		НовСтрока = ТаблТС.Добавить();
		НовСтрока.Ссылка = ТекТС;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуТСОчистка(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда 
		ТаблТС.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЛогВЖурналРегистрации(Знач ИмяИсточникаДанных, Знач ДатаС, Знач ДатаПо, Знач МассивТС)
	
	Если МассивТС.Количество() = 0 Тогда 
		ПредставлениеТС = НСтр("ru = 'всем ТС'; en = 'to all vehicles'");
	Иначе 
		СтрокаТС = "";
		Для Каждого ТекТС Из МассивТС Цикл 
			СтрокаТС = СтрокаТС + ?(СтрокаТС = "", "", ", ") + Строка(ТекТС);
		КонецЦикла;
		ПредставлениеТС = НСтр("ru='ТС:';en='Vehicle:'") + " " + СтрокаТС;
	КонецЕсли;
	
	ТекстШаблона = НСтр("ru = 'Выполнена очистка'; en = 'Cleaning completed'") + " %1 " + НСтр("ru = 'по'; en = 'By'")
		+ " %2 " + НСтр("ru='за период с';en='for the period from'") + " %3 " + НСтр("ru = 'по'; en = 'By'") + " %4";
	
	ТекстЛога = СтрШаблон(ТекстШаблона, ИмяИсточникаДанных, ПредставлениеТС, Строка(ДатаС), Строка(ДатаПо));
	
	ЗаписьЖурналаРегистрации(
		"Очистка истории",
		УровеньЖурналаРегистрации.Информация,
		Метаданные.Обработки.уатОчисткаИстории,
		,
		ТекстЛога
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Результат.Свойство("флПробегРасходПоМониторингу",   РеглЗадание_флПробегРасходПоМониторингу);
		Результат.Свойство("флДополнительныеСведенияПоGPS", РеглЗадание_флДополнительныеСведенияПоGPS);
		Результат.Свойство("флКоординатыПоМониторингу",     РеглЗадание_флКоординатыПоМониторингу);
		Результат.Свойство("флИсторияМестоположенияПоGPS",  РеглЗадание_флИсторияМестоположенияПоGPS);
		Результат.Свойство("флИсторияОпозданий",            РеглЗадание_флИсторияОпозданий);
		Результат.Свойство("ВидПериода",                    РеглЗадание_ВидПериода);
		Результат.Свойство("Количество",                    РеглЗадание_Количество);
		
		Результат.Свойство("Модифицированность",            Модифицированность);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеВручную(РеглЗадание, РеглЗаданиеНаименование)
	МассивСообщенийОбОшибках = Новый Массив;
	
	ПараметрыВыполнения = ВыполнитьРегламентноеЗаданиеВручнуюНаСервере(РеглЗадание);
	Если ПараметрыВыполнения.ЗапускВыполнен Тогда
		
		ПоказатьОповещениеПользователя(
		НСтр("ru='Запущена процедура регламентного задания';en='Scheduled job is launched'"), ,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("en = '%1.
                                                                      |The procedure is run in background job%2'; ru = '%1.
                                                                      |Процедура запущена в фоновом задании %2'"),
		РеглЗаданиеНаименование,
		Строка(ПараметрыВыполнения.МоментЗапуска)),
		БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		
		ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Добавить(
		ПараметрыВыполнения.ИдентификаторФоновогоЗадания,
		РеглЗаданиеНаименование);
		
		ПодключитьОбработчикОжидания(
		"СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания", 0.1, Истина);
	ИначеЕсли ПараметрыВыполнения.ПроцедураУжеВыполняется Тогда
		МассивСообщенийОбОшибках.Добавить(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("en = 'Procedure of scheduled job ""%1"" is
              |already executed in background job ""%2"" started %3.'; ru = 'Процедура регламентного задания ""%1""
              |  уже выполняется в фоновом задании ""%2"", начатом %3.'"),
		РеглЗаданиеНаименование,
		ПараметрыВыполнения.ПредставлениеФоновогоЗадания,
		Строка(ПараметрыВыполнения.МоментЗапуска)));
	КонецЕсли;
	
	КоличествоОшибок = МассивСообщенийОбОшибках.Количество();
	Если КоличествоОшибок > 0 Тогда
		ЗаголовокТекстаПроОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Задания выполнены с ошибками (%1 из %2)';en='Jobs are completed with errors (%1 out of %2)'"),
		Формат(КоличествоОшибок, "ЧГ="),
		Формат(1, "ЧГ="));
		
		ТекстВсехОшибок = Новый ТекстовыйДокумент;
		ТекстВсехОшибок.ДобавитьСтроку(ЗаголовокТекстаПроОшибки + ":");
		Для Каждого ТекстЭтойОшибки Из МассивСообщенийОбОшибках Цикл
			ТекстВсехОшибок.ДобавитьСтроку("");
			ТекстВсехОшибок.ДобавитьСтроку(ТекстЭтойОшибки);
		КонецЦикла;
		
		Если КоличествоОшибок > 5 Тогда
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(1, НСтр("ru='Показать ошибки';en='Show errors'"));
			Кнопки.Добавить(КодВозвратаДиалога.Отмена);
			
			ПоказатьВопрос(
			Новый ОписаниеОповещения(
			"ВыполнитьРегламентноеЗаданиеВручнуюЗавершение", ЭтотОбъект, ТекстВсехОшибок),
			ЗаголовокТекстаПроОшибки, Кнопки);
		Иначе
			ПоказатьПредупреждение(, СокрЛП(ТекстВсехОшибок.ПолучитьТекст()));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеВручнуюЗавершение(Ответ, ТекстВсехОшибок) Экспорт
	
	Если Ответ = 1 Тогда
		ТекстВсехОшибок.Показать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания()
	
	ОповещенияОбОкончанииВыполнения = ОповещенияОбОкончанииВыполненияРегламентныхЗаданий();
	Для каждого Оповещение Из ОповещенияОбОкончанииВыполнения Цикл
		
		ПоказатьОповещениеПользователя(
			НСтр("ru='Выполнена процедура регламентного задания';en='Scheduled job procedure is executed'"),
			,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("en = '%1. The procedure is completed in background job %2'; ru = '%1. Процедура завершена в фоновом задании %2'"),
				Оповещение.ПредставлениеРегламентногоЗадания,
				Строка(Оповещение.МоментОкончания)),
			БиблиотекаКартинок.ВыполнитьРегламентноеЗаданиеВручную);
		ОбновитьДанныеРеглЗаданий();
	КонецЦикла;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		
		ПодключитьОбработчикОжидания(
			"СообщитьОбОкончанииРучногоВыполненияРегламентногоЗадания", 2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьРегламентноеЗаданиеВручнуюНаСервере(Знач ИдентификаторРегламентногоЗадания)
	
	Результат = РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(ИдентификаторРегламентногоЗадания);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОповещенияОбОкончанииВыполненияРегламентныхЗаданий()
	
	ОповещенияОбОкончанииВыполнения = Новый Массив;
	
	Если ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() > 0 Тогда
		Индекс = ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Количество() - 1;
		
		УстановитьПривилегированныйРежим(Истина);
		Пока Индекс >= 0 Цикл
			
			НовыйУникальныйИдентификатор = Новый УникальныйИдентификатор(
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Значение);
			Отбор = Новый Структура;
			Отбор.Вставить("УникальныйИдентификатор", НовыйУникальныйИдентификатор);
			
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			
			Если МассивФоновыхЗаданий.Количество() = 1 Тогда
				МоментОкончания = МассивФоновыхЗаданий[0].Конец;
				
				Если ЗначениеЗаполнено(МоментОкончания) Тогда
					
					ОповещенияОбОкончанииВыполнения.Добавить(
						Новый Структура(
							"ПредставлениеРегламентногоЗадания,
							|МоментОкончания",
							ИдентификаторыФоновыхЗаданийПриРучномВыполнении[Индекс].Представление,
							МоментОкончания));
					
					ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
				КонецЕсли;
			Иначе
				ИдентификаторыФоновыхЗаданийПриРучномВыполнении.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ОповещенияОбОкончанииВыполнения;
	
КонецФункции

Процедура ОбновитьДанныеРеглЗаданий()
	Попытка
		ОбновитьДанныеРеглЗаданийСервер();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеРеглЗаданийСервер()
	
	ТипФоновоеЗадание		 = Тип("ФоновоеЗадание");
	ТипИнформацияОбОшибке	 = Тип("ИнформацияОбОшибке");
	
	РеглЗадание_ОчисткаДанных = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.уатОчисткаДанныхМониторинга);
	ОчисткаДанных             = РеглЗадание_ОчисткаДанных.УникальныйИдентификатор;
	
	Подсказка =  НСтр("ru='Никогда не выполнялось';en='Never execute'");
	Если РеглЗадание_ОчисткаДанных = Неопределено Тогда
		ПредставлениеРасписания = НСтр("ru='Регламентное задание не найдено';en='Scheduled job is not found'");
		РегламентноеЗадание_Использование = Ложь;
	Иначе
		ПоследнееФоновоеЗадание = РегламентныеЗаданияСлужебный.СвойстваФоновыхЗаданий(Новый Структура("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания,
		|ИдентификаторРегламентногоЗадания", Истина, ОчисткаДанных));
		Подсказка = ?(РеглЗадание_ОчисткаДанных.Использование, 
		НСтр("ru='Используется';en='Used'"), НСтр("ru='Не используется';en='Not used'"));
		Если ПоследнееФоновоеЗадание.Количество() > 0 Тогда
			Подсказка = Подсказка + ", " + Строка(ПоследнееФоновоеЗадание[0].Состояние)
			+ " " + Строка(?(Значениезаполнено(ПоследнееФоновоеЗадание[0].Конец), ПоследнееФоновоеЗадание[0].Конец, ""));
		КонецЕсли;
	КонецЕсли;
	
	Если Подсказка <> Элементы.НастроитьРегламентноеЗадание_Статус.Заголовок Тогда
		Элементы.НастроитьРегламентноеЗадание_Статус.Заголовок = Подсказка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
